Repository: librehat/com.librehat.yahooweather
Catalog: translations/*/LC_MESSAGES/com.librehat.yahooweather.po
Languages: pl, ro

source: YAHOO! Weather
pl: Yahoo! Pogoda
ro: YAHOO!Starea vremii

source: Feels like
pl: Odczuwalna
ro: Se simt

source: Sunrise
pl: Wschód
ro: Răsare

source: Sunset
pl: Zachód
ro: Apune

source: Humidity
pl: Wilgotność
ro: Umiditate

source: Pressure
pl: Ciśnienie
ro: Presiune

source: Visibility
pl: Widoczność
ro: Vizibilitate

source: NULL
pl: BRAK
ro: Zero

source: Wind
pl: Wiatr
ro: Vânt

source: Error 1. Please check your network.
pl: Error 1. Spradź połączenie sieciowe
ro: Eroare 1. Verificați rețeaua.

source: Error 2. WOEID may be invalid.
pl: Error 2. Niewłaściwy numer WOEID
ro: Eroare. WOEID invalid

source: Sunday
pl: Niedziela
ro: Duminică

source: Monday
pl: Poniedziałek
ro: Luni

source: Tuesday
pl: Wtorek
ro: Marți

source: Wednesday
pl: Środa
ro: Miercuri

source: Thursday
pl: Czwartek
ro: Joi

source: Friday
pl: Piątek
ro: Vineri

source: Saturday
pl: Sobota
ro: Sâmbătă

source: Tornado
ro: Tornadă

source: Tropical Storm
pl: Sztorm tropikalny
ro: Furtună tropicală

source: Hurricane
pl: Huragan
ro: Uragan

source: Severe Thunderstorms
pl: Silne burze
ro: Furtună cu descărcări electrice

source: Thunderstorms
pl: Burze
ro: Descărcări electrice

source: Mixed Rain and Snow
pl: Deszcz ze śniegiem
ro: Zloată

source: Mixed Rain and Sleet
pl: Deszcz i gołoledź
ro: Lapoviță

source: Mixed Snow and Sleet
pl: Śnieg i gołoledź
ro: Lapoviță și ninsoare

source: Freezing Drizzle
pl: Ślisko i mżawka
ro: Burniță rece

source: Drizzle
pl: Mżawka
ro: Burniță

source: Freezing Rain
pl: Oblodzenia
ro: Ploaie rece

source: Showers
pl: Przelotny deszcz
ro: Plouă

source: Snow Flurries
pl: Ulewny deszcz
ro: Ninsoare în rafale

source: Light Snow Showers
pl: Deszczowo z przejaśnieniami
ro: Ninge liniștit

source: Blowing Snow
pl: Przelotny śnieg
ro: Ninge viscolit

source: Snow
pl: Śnieg
ro: Zăpadă

source: Hail
pl: Grad
ro: Grindină

source: Sleet
pl: Deszcz ze śniegiem
ro: Lapoviță

source: Dust
pl: Zamieć
ro: Praf

source: Foggy
pl: Mgliście
ro: Ceață

source: Haze
pl: Niweleka mgła
ro: Brumă

source: Smoky
pl: Widoczność słaba
ro: Pâclă

source: Blustery
pl: Widoczność dobra
ro: Vijelie

source: Windy
pl: Wietrznie
ro: Vânt

source: Cold
pl: Zimno
ro: Rece

source: Cloudy
pl: Zachurzenie duże
ro: Noros

source: Mostly Cloudy (Night)
pl: Zachmurzenie (noc)
ro: Cer acoperit (noapte)

source: Mostly Cloudy (Day)
pl: Zachmurzenie (dzień)
ro: Cer acoperit (zi)

source: Partly Cloudy (Night)
pl: Częściowe zachmurzenie (noc)
ro: Parțial noros (noapte)

source: Partly Cloudy (Day)
pl: Częściowe zachmurzenie (dzień)
ro: Parțial noros (zi)

source: Clear (Night)
pl: Noc pogodna
ro: Senin (noapte)

source: Sunny
pl: Słonecznie
ro: Însorit

source: Fair (Night)
pl: Noc pogodna
ro: Frumos (noapte)

source: Fair (Day)
pl: Dzień pogodny
ro: Frumos (zi)

source: Mixed Rain and Hail
pl: Deszcz i silny wiatr
ro: Ploaie și grindină

source: Hot
pl: Gorąco
ro: Cald

source: Isolated Thunderstorms
pl: Miejscowe burze
ro: Izolat rafale

source: Scattered Thunderstorms
pl: Gdzieniegdzie burze
ro: Rafale izolate

source: Scattered Showers
pl: Częściowe opady
ro: Plouă răzleț

source: Heavy Snow
pl: Silne opady śniegu
ro: Zăpada mare

source: Scattered Snow Showers
pl: Słabe opady śniegu
ro: Ninge izolat

source: Partly Cloudy
pl: Częściowe zachmurzenie
ro: Parțial noros

source: Thundershowers
pl: Zamieć
ro: Ploi torențiale

source: Snow Showers
pl: Opady śniegu
ro: Ninge

source: Isolated Thundershowers
pl: Przelotne opady śniegu
ro: Plouă izolat

source: Not Available
pl: Brak informacji
ro: Indisponibil

# NAME OF TRANSLATORS
source: Your names
ro: Daniel

# EMAIL OF TRANSLATORS
source: Your emails
ro: danielh1029@yahoo.com

source: Fahrenheit
pl: Faranhait

source: Celsius
pl: Celcjusza
